# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Diff that operates at the word level
brew "dwdiff"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Generic library support script
brew "libtool"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Node.js version manager
brew "nodenv"
# Libraries for security-enabled client and server applications
brew "nss"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk@11", link: true
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Service monitoring system and time series database
brew "prometheus"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-meslo-lg-nerd-font"
# SDK for building Flutter apps
cask "flutter"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "anthropic.claude-code"
vscode "bierner.emojisense"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "tamasfe.even-better-toml"
