tap "homebrew/bundle"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# User-friendly launcher for Bazel
brew "bazelisk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that operates at the word level
brew "dwdiff"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Generic library support script
brew "libtool"
# Utility for directing compilation
brew "make"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Libraries for security-enabled client and server applications
brew "nss"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk@11", link: true
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Service monitoring system and time series database
brew "prometheus"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Battery health management and charging control
cask "aldente"
# Meslo Nerd Font with icon support for terminals
cask "font-meslo-lg-nerd-font"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Replacement for Terminal and the successor to iTerm
cask "iterm2"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal with AI features
cask "warp"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "hashicorp.terraform"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
