tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jesseduffield/lazydocker"
tap "minamijoyo/tfschema"
brew "ant"
brew "autoconf"
brew "automake"
brew "python@3.9"
brew "aws-shell"
brew "awscli"
brew "cairo"
brew "ccache"
brew "coreutils"
brew "dnsmasq"
brew "duff"
brew "exif"
brew "exiftool"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "google-authenticator-libpam"
brew "harfbuzz"
brew "pango"
brew "libtool"
brew "graphviz"
brew "grep"
brew "htop"
brew "hub"
brew "jq"
brew "make"
brew "mkcert"
brew "nss"
brew "openjdk@11"
brew "packer"
brew "pidcat"
brew "prometheus"
brew "pyenv"
brew "python@3.7"
brew "python@3.8"
brew "ruby"
brew "terraform", link: false
brew "terraform-docs"
brew "terraform_landscape"
brew "tfenv"
brew "watch"
brew "watchman"
brew "wget"
brew "jesseduffield/lazydocker/lazydocker"
brew "minamijoyo/tfschema/tfschema"
cask "1password-cli"
cask "adoptopenjdk8"
cask "authy"
cask "aws-vault"
cask "docker"
cask "drawio"
cask "dropbox"
cask "iterm2"
cask "java8"
cask "quip"
cask "visual-studio-code"
